using AMapWebservice.Request;
using AMapWebservice.Request.Models;
using AMapWebservice.Util;
using AMapWebservice;
using Microsoft.VisualStudio.TestTools.UnitTesting;
using System;
using System.Linq;

namespace AMapWebServiceTest
{
    [TestClass]
    public class AmapClientUtilTest
    {
        AMapClient client = null;
        string[] addresses = null;
        string[] locations = null;

        [TestInitialize]
        public void TestIntialize()
        {
            client = AMapConfig.GetClient();
            if (client == null)
            {
                AMapConfig.AddAmapConfig("511b21a2f1c05c2f03b2ea6157b95a3b4d");  //amap key is error, please assign your app key;
            }
            client = AMapConfig.GetClient();
            addresses = new string[]
            {
                "广东省广州市天河区珠江东路16号高德置地冬广场G座34层",
"广东省广州市天河区海安路13号财富广场A栋3003",
"广东省广州市越秀区寺右新马路111-115号五羊新城广场1919",
"广东省广州市越秀区广州大道北197号新达城6楼",
"广东省广州市越秀区越华路112号珠江国际大厦1402",
"广东省广州市天河区珠江新城华利路23号远洋明珠大厦东塔2401",
"广东省广州市天河区珠江西路5号广州国际金融中心8楼06-10单元世联空间",
"广东省广州市越秀区中山二路中国电信营业厅18号首层",
"广东省广州市天河区天河路228号正佳广场3楼3A020-2铺",
"广东省广州市天河区交通集团天河汽车客运站东侧新天地C座1001",
"广东省广州市天河区黄埔大道西100号富力盈泰B1508",
"广东省广州市天河区广园东路2191号时代南2501_04单元",
"广东省广州市海珠区琶洲大道东1号南塔608",
"广东省广州市天河区天河南一路16号天河联通营业厅2楼(天河城南门斜对面",
"广东省广州市海珠区海联路25号2楼208",
"广东省广州市天河区林和西路9号耀中广场A座2601",
"广东省广州市天河区天河北路183号大都会广场21楼",
"广东省广州市天河区华穗路406号保利克洛维中景B2705",
"广东省广州市天河区海安路13号财富世纪广场-907",
"广东省广州市天河区黄埔大道萝斗岗1号翠湖山庄-会所负一楼",
"广东省广州市天河区天河北路689号光大银行大厦-2414",
"广东省广州市天河区天河北路689号光大银行大厦-8A5",
"广州市海珠区会展南五路1-5号中州交易中心1213房",
"广东省广州市天河区华穗路406号克洛维中景-2424",
"广东省广州市天河区华穗路406号克洛维中景B座1110",
"广东省广州市天河区华明路13号华普广场西塔-2709",
"广东省广州市海珠区琶洲大道东1号保利国际广场南塔2003",
"广东省广州市海珠区新港东路638号朗豪酒店3楼(芬国际月子中心)",
"广东省广州市天河区珠江东路6号(周大福金融中心)K11购物中心-5008",
"广东省广州市天河区珠江新城马场路28号富力公园28(B2-4103)",
"广东省广州市越秀区东风中路418号华以泰1204",
"广东省广州市天河区华强路9号克洛维中盈-2005",
"广东省广州市天河区海安路13号财富世纪广场-1901-1904",
"广东省广州市天河区冼村路11号保利威座北塔-1103",
"广东省广州市天河区华明路13号华普广场西塔-1702",
"广东省广州市天河区华夏路16号富力盈凯-4207",
"广东省广州市天河区平云路163号平云广场B塔-8楼",
"广东省广州市天河区珠江东路6号(周大福金融中心)K11购物中心-2606",
"广东省广州市天河区华明路13号华普广场东塔-2502",
"广东省广州市天河区黄埔大道中309-315号羊城创意园2-27",
"广东省广州市天河区天源路(地铁3、6号线天河客运站A、D出口)天河新天地b座1517",
"广东省广州市天河区体育西路191号中石化大厦B座-801-806",
"广东省广州市天河区体育西路191号中石化大厦B座-2011-2013",
"广东省广州市天河区珠江东路6号(周大福金融中心)K11购物中心-14F，1507-1512",
"广东省广州市天河区天河北路689号光大银行大厦-202，3F",
"广东省广州市天河区华夏路16号富力盈凯-2601",
"广东省广州市天河区华夏路16号富力盈凯-2901",
"广东省广州市天河区中山大道中439号天银商贸大厦-2501-04，13-15",
"广东省广州市天河区中山大道中439号天银商贸大厦-2110",
"广东省广州市天河区华强路9号克洛维中盈-2105",
"广东省广州市天河区华强路9号克洛维中盈-1705D",
"广东省广州市天河区珠江东路6号(周大福金融中心)1601",
"广州市越秀区广州市越秀区东风中路362号颐德中心20层",
"广东省广州市天河区珠江新城兴民路222号天盈广场西塔-1809",
"广东省广州市天河区黄埔大道西100号富力盈泰A座13A11",
"广东省广州市海珠区琶洲大道东1号保利国际广场南塔-2002",
"广东省广州市越秀区东风东路733号羊城晚报社羊城同创印刷楼6楼",
"广东省广州市天河区天河路208号粤海大厦18楼",
"广东省广州市天河区冼村路11号保利威座北塔-2904",
"广东省广州市天河区体育西路191号中石化大厦B座-4701",
"广东省广州市天河区中山大道科韵路33-49号方圆E时光-604/705",
"广东省广州市天河区华利路19号远洋明珠大厦4楼",
"广东省广州市天河区黄埔大道中309-315号羊城创意园自编2-17-",
"广东省广州市天河区海明路22号MintEL商务公寓东区235",
"广东省广州市越秀区东华西路荣华南1号邮局",
"广东省广州市天河区科韵路200号软件园建中路44号4楼整层",
"广东省广州市海珠区琶洲大道东路2-8号广州国际采购中心物业",
"广东省广州市天河区黄埔大道西100号富力盈泰B座2201",
"广东省广州市天河区珠江新城华夏路28号富力盈信23A12",
"广东省广州市天河区珠江新城兴民路222号天盈广场西塔1503",
"广东省广州市天河区冼村路11号保利威座南塔-负一层",
"广东省广州市天河区珠江东路6号(周大福金融中心)K11购物中心5002-5005",
"广东省广州市天河区海安路13号财富世纪广场-1203",
"广东省广州市天河区天河北路689号光大银行大厦-911",
"广东省广州市天河区华利路59号保利大厦-物业服务中心",
"广州市越秀区先烈中路69东山广场主楼27层",
" 广州市天河区华夏路16号富力盈凯3209",
"广东省广州市天河区冼村路11号保利威座北塔-3501",
"广东省广州市天河区中山大道科韵路33-49号方圆E时光-405",
"广东省广州市海珠区新港东路1000号保利世贸C座西塔-1507",
"广东省广州市天河区五山路248号金山大厦北塔-2208",
"广东省广州市天河区天河路490号壬丰大厦3015",
"广东省广州市天河区珠江新城兴民路222号天盈广场西塔1708",
"广东省广州市海珠区新港东路1000号保利世贸C座西塔-1007",
"广东省广州市天河区体育西路191号中石化大厦B座-4725",
"广东省广州市越秀区麓景路7号老干大厦东楼3楼整层",
"广东省广州市越秀区德政北路538号达信大厦703-704室",
"广东省广州市越秀区广州大道中289号南方传媒大厦",
"广东省广州市越秀区广州大道中289号南方传媒大厦四号楼3楼",
"广东省广州市越秀区广州大道中289号文化艺术产业园501",
"广东省广州市海珠区琶洲大道东1号保利国际广场南塔-2102",
"广东省广州市越秀区东风东路733号羊城晚报社羊城同创汇",
"广东省广州市天河区海安路7号龙胜苑首层管理处",
"广东省广州市天河区黄埔大道西483号",
"广东省广州市天河区华夏路8号合景国际金融广场7楼",
"广州市天河区天河直街30-1 金中环大厦A座37楼",
"广东省广州市天河区兴安路15号保利中达广场3号楼2312房",
"广东省广州市天河区广州大道中289号南方传媒大厦A塔1609室",
"广东省广州市越秀区广州大道中289号南方传媒四号楼四楼",
"广东省广州市天河区珠江东路6号(周大福金融中心)1705-1706-",
"广东省广州市越秀区广州大道中289号四号楼303室/304室",
"广东省广州市越秀区东风中路363号国信大厦27楼35楼",
"广东省广州市天河区体育西路101号维多利A座2102",
"广东省广州市越秀区先烈中路80号汇华商贸大厦15楼",
"广东省广州市天河区天河体育西路111号至115号建和中心20楼",
"广东省广州市天河区天河北路28号时代广场中座1106A房",
"广东省广州市越秀区广州大道中303号一楼出单处",
"广东省广州市天河区沾益直街134号广州房建公寓段",
"广东省广州市天河区龙口西路576号天隆写字楼二楼203房",
"广东省广州市越秀区长堤大马路316号27楼2702房",
"广州市天河区花城大道3号皇朝阁7楼南侧",
"广东省广州市天河区天河路93号海角楼18楼",
"广州市白云区白云嘉禾望岗均禾大街嘉达科创大厦502室",
"广州市天河区林和中路168号",
"广东省广州市越秀区东风东路767号东宝大厦903-906室",
"广东省广州市越秀区东风中路268号广州交易广场2-3层",
"广东省广州市越秀区东华南路98号海印中心11楼",
"广东省广州市越秀区环市东路372号东方正佳广场3015",
"广东省广州市天河区粤垦路1号",
"广东省广州市海珠区工业大道革新路新民八街36号大阪仓1904创意产业园",
"广东省广州市天河区体育西路191号中石化大厦B座3712-",
"广州市天河区华强路3-2号富力盈力北塔1102-1103室",
"合群中路25号附近合群楼（美华北路门登记进入）",
"广东省广州市天河区花城大道87号高德置地广场A座2301室",
"广东省广州市天河区天河北路689号光大银行大厦1408-1409",
"广州市荔湾区康王北路976号荔康大厦",
"广东省广州市荔湾区流花路85号5楼",
"广东省广州市越秀区永福路49号福怡大厦901",
"广东省广州市越秀区恒福路238号218室",
"广东省广州市荔湾区中山八路23号富力商贸大厦4楼",
"广州市越秀区南东园横路1号",
"广东省广州市荔湾区芳村花地大道南8号北门22号楼三楼",
"广州市越秀区环市东路339号广东国际大厦主楼20层",
"广东省广州市天河区天河路101号兴业银行大厦10楼",
"广东省广州市天河区天府路233号华建大厦A座7楼",
"广东省广州市海珠区琶洲大道东路2-8号广州国际采购中心1115室",
"广东省广州市海珠区琶洲大道东路2-8号广州国际采购中心910室",
"广东省广州市天河区马场路539号",
"广东省广州市天河区天源路28号首层",
"广东省广州市天河区体育西路103号维多利A座48F",
"广东省广州市越秀区光明路28号6楼",
"天河区广州大道北512号（兴华路公交站往回走10米）",
"广东省广州市越秀区东风中路363号国信大厦3楼全层",
"广东省广州市越秀区越华路112号珠江国际大厦1303",
"广东省广州市天河区天河北路689号光大银行大厦906之一",
"广东省广州市越秀区寺右二马路57号自编A9档",
"广东省广州市天河区林和中路8号海航大厦803",
"广东省广州市天河区中山大道西140号华港商务大厦1414-15",
"广东省广州市天河区黄埔大道中309-315号羊城创意产业园2-23",
"广州市越秀区环市东路334号市政中环大厦20楼",
"广州市天河区科韵路16号信息港a栋303",
            };
            locations = new string[]
            {
                "113.234850,23.095634",
"113.238051,23.101606",
"113.244611,23.127593",
"113.247709,23.133533",
"113.251210,23.156082",
"113.252333,23.246196",
"113.254400,23.129229",
"113.254560,23.132981",
"113.262606,23.131220",
"113.263486,23.125021",
"113.264592,23.172104",
"113.269055,23.123422",
"113.269194,23.129291",
"113.272164,23.123408",
"113.272482,23.135410",
"113.275693,23.115688",
"113.276626,23.132959",
"113.277272,22.999644",
"113.277520,23.109067",
"113.278391,23.131784",
"113.281520,23.135523",
"113.281619,23.127199",
"113.282129,23.141921",
"113.284718,23.134604",
"113.284850,23.133725",
"113.293531,23.120385",
"113.295641,23.124998",
"113.299537,23.118138",
"113.300350,23.146447",
"113.302981,23.083955",
"113.305753,23.119685",
"113.310437,23.134826",
"113.311567,23.142782",
"113.314312,23.122930",
"113.314578,23.118051",
"113.314780,23.122370",
"113.315857,23.134418",
"113.316368,23.124662",
"113.317167,23.133515",
"113.317260,23.126338",
"113.317410,23.157478",
"113.318594,23.134434",
"113.319788,23.127079",
"113.321039,23.140105",
"113.321189,23.128583",
"113.321270,23.179422",
"113.321822,23.118572",
"113.322420,23.150864",
"113.322555,23.141699",
"113.322929,23.124235",
"113.322940,23.118340",
"113.323121,23.150971",
"113.323687,23.166156",
"113.324851,23.127867",
"113.326050,23.144530",
"113.326108,23.117814",
"113.326296,23.126597",
"113.327016,23.119985",
"113.327311,23.121573",
"113.329430,23.132128",
"113.330490,23.120291",
"113.333920,23.127490",
"113.334012,23.180235",
"113.334545,23.141956",
"113.335050,23.132920",
"113.335386,23.148889",
"113.335632,23.125605",
"113.339154,23.143599",
"113.339196,23.134116",
"113.339788,23.124555",
"113.342784,23.098431",
"113.347222,23.143984",
"113.356773,23.135642",
"113.361200,23.124680",
"113.363650,23.210370",
"113.366793,22.954169",
"113.367225,23.193406",
"113.367947,23.134367",
"113.370053,23.198799",
"113.371390,23.364434",
"113.372919,23.123133",
"113.376740,23.129300",
"113.383378,23.159345",
"113.384974,23.138446",
"113.385070,23.139442",
"113.386392,23.138044",
"113.386894,23.138653",
"113.389435,23.126962",
"113.393740,23.110190",
"113.400502,23.119884",
"113.401078,23.114379",
"113.402760,23.122187",
"113.403273,23.114460",
"113.404393,23.133567",
"113.404423,23.091143",
"113.409373,23.124288",
"113.410300,23.123961",
"113.414850,23.124886",
"113.425522,23.166527",
"113.431947,23.383966",
"113.439834,23.165836",
"113.502290,23.174042",
"113.604623,23.121575",
"113.608219,23.119676",
            };
        }

        [TestCleanup]
        public void TestCleanup()
        {

        }

        [TestMethod]
        public void GeoRequestTest()
        {
            var firstGeo = AMapClientUtil.GetGeoResult("方恒国际中心A座", "北京");
            Assert.IsTrue(firstGeo.city == "北京市");
            Assert.IsTrue(firstGeo.formatted_address == "北京市朝阳区方恒国际中心|A座");
            Assert.IsTrue(firstGeo.province == "北京市");
            Assert.IsTrue(firstGeo.citycode == "010");
            Assert.IsTrue(firstGeo.district == "朝阳区");

            foreach(var address in addresses)
            {
                firstGeo = AMapClientUtil.GetGeoResult(address);
                Assert.IsNotNull(firstGeo, address + " 不应该解析为null");
            }
        }

        /// <summary>
        /// 逆地址解析;
        /// </summary>
        [TestMethod]
        public void ReGeoRequestTest()
        {
            foreach (var location in locations)
            {
                try
                {
                    var regeoResult = AMapClientUtil.ReGetGeoResult(location);
                }
                catch(Exception exp) 
                {
                    Assert.Fail(location + " 逆地址解析 " + exp.Message);
                }
            }
        }
    }
}
